# 1. Напиши программу, в которой создай несколько переменных и каждой из них присвой любые значения следующих типов:
#     • целое число
#     • вещественное число
#     • строка
#     • список
#     • кортеж
#     • словарь
#     • множество
# Используя функцию type(), выведи на отдельных строках информацию о том, к каким классам относится каждый объект.
#
# Выходные данные:
# Выводятся строки.

a1 = 1
a2 = 1.2
a3 = '123'
a4 = [1, 2, 3]
a5 = (1, 2, 3)
a6 = {1: 200}
a7 = {1, 2, 3}
print(type(a1))
print(type(a2))
print(type(a3))
print(type(a4))
print(type(a5))
print(type(a6))
print(type(a7))
